### loc: Label  ,  iloc: Position

In [52]:
import pandas as pd

# information about employees
id_number = ['128', '478', '257', '299', '175', '328', '099', '457', '144', '222']
name = ['Patrick', 'Amanda', 'Antonella', 'Eduard', 'John', 'Alejandra', 'Layton', 'Melanie', 'David', 'Lewis']
surname = ['Miller', 'Torres', 'Brown', 'Iglesias', 'Wright', 'Campos', 'Platt', 'Cavill', 'Lange', 'Bellow']
division = ['Sales', 'IT', 'IT', 'Sales', 'Marketing', 'Engineering', 'Engineering', 'Sales', 'Engineering', 'Sales']
salary = [30000, 54000, 80000, 79000, 15000, 18000, 30000, 35000, 45000, 30500]
telephone = ['7366578', '7366444', '7366120', '7366574', '7366113', '7366117', '7366777', '7366579', '7366441', '7366440']
type_contract = ['permanent', 'temporary', 'temporary', 'permanent', 'internship', 'internship', 'permanent', 'temporary', 'permanent', 'permanent']

# data frame containing information about employees
df = pd.DataFrame({'name': name, 'lastname': surname, 'div': division,
                             'salary': salary, 'tele': telephone, 'contract': type_contract}, index=id_number)

df.head(3)

          name lastname    div  salary     tele   contract
128    Patrick   Miller  Sales   30000  7366578  permanent
478     Amanda   Torres     IT   54000  7366444  temporary
257  Antonella    Brown     IT   80000  7366120  temporary

#### Selecting multiple columns by label:

In [53]:
df_employees = df

In [8]:
df[["lastname","div"]].head(3)

    lastname    div
128   Miller  Sales
478   Torres     IT
257    Brown     IT

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, 128 to 222
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   lastname  10 non-null     object
 2   div       10 non-null     object
 3   salary    10 non-null     int64
 4   tele      10 non-null     object
 5   contract  10 non-null     object
dtypes: int64(1), object(5)
memory usage: 560.0+ bytes

#### Selecting columns by data type

In [16]:
df.select_dtypes(include=int).head(2)   #Doent print even salary, same results for float!

Empty DataFrame
Columns: []
Index: [128, 478]

In [18]:
df.select_dtypes(include=object).head(2)

        name lastname    div     tele   contract
128  Patrick   Miller  Sales  7366578  permanent
478   Amanda   Torres     IT  7366444  temporary

In [15]:
import numpy as np

df.select_dtypes(include = np.number).head(3)

     salary
128   30000
478   54000
257   80000

In [20]:
df.select_dtypes(include = np.object).head(3)

          name lastname    div     tele   contract
128    Patrick   Miller  Sales  7366578  permanent
478     Amanda   Torres     IT  7366444  temporary
257  Antonella    Brown     IT  7366120  temporary

#### Selecting a single row by label

In [21]:
df.index

Index(['128', '478', '257', '299', '175', '328', '099', '457', '144', '222'], dtype='object')

In [23]:
#selection by loc using no. in index 

df.loc["128"]

name          Patrick
lastname       Miller
div             Sales
salary          30000
tele          7366578
contract    permanent
Name: 128, dtype: object

In [30]:
df.loc[["128"]]

        name lastname    div  salary     tele   contract
128  Patrick   Miller  Sales   30000  7366578  permanent

In [25]:
df.loc[["128","478"]]

        name lastname    div  salary     tele   contract
128  Patrick   Miller  Sales   30000  7366578  permanent
478   Amanda   Torres     IT   54000  7366444  temporary

#### Selecting a single row by position

The .iloc[] indexer is used to index a data frame by position. To select a single row with the .iloc[] attribute, we pass in the row position (a single integer) to the indexer.

In [27]:
df.iloc[-1]     #last element

name            Lewis
lastname       Bellow
div             Sales
salary          30500
tele          7366440
contract    permanent
Name: 222, dtype: object

.iloc[] indexer returns a Series object that has the column names as indexes. However, as we did with the .iloc[] indexer, we can also obtain a DataFrame by passing a single-integer list to the indexer in the following way.

In [29]:
df.iloc[[-1]]   #notie difference in output

      name lastname    div  salary     tele   contract
222  Lewis   Bellow  Sales   30500  7366440  permanent

In [32]:
df.iloc[[-1,-2,0]]

        name lastname          div  salary     tele   contract
222    Lewis   Bellow        Sales   30500  7366440  permanent
144    David    Lange  Engineering   45000  7366441  permanent
128  Patrick   Miller        Sales   30000  7366578  permanent

#### Slicing

In [33]:
df.iloc[0:4]

          name  lastname    div  salary     tele   contract
128    Patrick    Miller  Sales   30000  7366578  permanent
478     Amanda    Torres     IT   54000  7366444  temporary
257  Antonella     Brown     IT   80000  7366120  temporary
299     Eduard  Iglesias  Sales   79000  7366574  permanent

#### Selecting rows and columns simultaneously

In [38]:
df.loc['478', 'salary']     #Priniting salary corresponding to particular row/Index

#Note: iloc gives error in this

54000

#### Selecting a single row and multiple columns

In [39]:
df_employees.iloc[1, [0, 1, 3]]   #Selecting 1st,2nd and 4th columns for 2nd row

name       Amanda
surname    Torres
salary      54000
Name: 478, dtype: object

#### Selecting disjointed rows and columns

To select multiple rows and columns, we need to pass two list of values to both indexers

In [41]:
# select the name, surname, and salary of the employees with id number 478 and 222 by position
df_employees.iloc[[1, 9], [0, 1, 3]]

# select the name, surname, and salary of the employees with id number 478 and 222 by label
df_employees.loc[['478', '222'], ['name', 'surname', 'salary']]

       name surname  salary
478  Amanda  Torres   54000
222   Lewis  Bellow   30500

#### Selecting continuous rows and columns

In [42]:
# select the name, surname, and salary of the employees with id number 128, 478, 257, 299 by position
df_employees.iloc[:4, [0, 1, 3]]

# select the name, surname, and salary of the employees with id number 128, 478, 257, 299 by label
df_employees.loc[:'299', ['name', 'surname', 'salary']]

          name   surname  salary
128    Patrick    Miller   30000
478     Amanda    Torres   54000
257  Antonella     Brown   80000
299     Eduard  Iglesias   79000

#### Selecting a scalar value using the .at[] and .iat[] indexers

Pandas provides two optimized functions to extract a scalar value from a data frame object: the .at[] and .iat[] operators. The former extracts a single value by label, while the latter access a single value by position.
Selecting a scalar value by label and position

→ df.at[string, string]

→ df.iat[integer, integer]

In [46]:
# select the salary of the employee with id number 478 by label
df_employees.at['478', 'salary']

54000

In [45]:

# select the salary of the employee with id number 478 by position
df_employees.iat[1, 3]

54000

#### %timeit magic function to calculate the execution time of both Python statements. 
 
 As shown below, the .at[] and .iat[] operators are much faster than the .loc[] and .iloc[] indexers.

In [48]:
# execution time of the loc indexer
%timeit df_employees.loc['478', 'salary']

6.37 µs ± 300 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [49]:
# execution time of the at indexer
%timeit df_employees.at['478', 'salary']

3.43 µs ± 221 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

### that the .at[] and .iat[] indexers can only be used to access a single value

#### Boolean selection according to the values of a single column

In [50]:
df_employees[df_employees['salary'] > 45000]   #Printing all values falling in

          name   surname division  salary telephone type_contract
478     Amanda    Torres       IT   54000   7366444     temporary
257  Antonella     Brown       IT   80000   7366120     temporary
299     Eduard  Iglesias    Sales   79000   7366574     permanent

In [57]:
df_employees['salary'] > 45000   #Printing True false

128    False
478     True
257     True
299     True
175    False
328    False
099    False
457    False
144    False
222    False
Name: salary, dtype: bool

#### Boolean selection according to the values of multiple columns

In [59]:
df_employees[(df_employees['salary'] > 45000) & (df_employees['contract'] == 'permanent')]

       name  lastname    div  salary     tele   contract
299  Eduard  Iglesias  Sales   79000  7366574  permanent

#### As you may know, in Python, the comparison operators have a higher precedence than the logical operators. However, it does not apply to Pandas where logical operators have higher precedence than comparison operators. Therefore, we need to wrap each boolean expression in parenthesis to avoid an error.

#### The isin method

##### pandas.Series.isin

In [61]:
# select employees with a permanent or temporary contract using the logical operaror or
df_employees[(df_employees['contract'] == 'temporary') | (df_employees['contract'] == 'permanent')]

# select employees with a permanent or temporary contract using the isin method
df_employees[df_employees['contract'].isin(['temporary', 'permanent'])]

          name  lastname          div  salary     tele   contract
128    Patrick    Miller        Sales   30000  7366578  permanent
478     Amanda    Torres           IT   54000  7366444  temporary
257  Antonella     Brown           IT   80000  7366120  temporary
299     Eduard  Iglesias        Sales   79000  7366574  permanent
099     Layton     Platt  Engineering   30000  7366777  permanent
457    Melanie    Cavill        Sales   35000  7366579  temporary
144      David     Lange  Engineering   45000  7366441  permanent
222      Lewis    Bellow        Sales   30500  7366440  permanent

#### The between method
The pandas.Series.between method

In [64]:
# employees with a salary higher than or equal to 30000 and less than or equal to 50000 euros
df_employees[df_employees['salary'].between(30000, 50000)]

        name lastname          div  salary     tele   contract
128  Patrick   Miller        Sales   30000  7366578  permanent
099   Layton    Platt  Engineering   30000  7366777  permanent
457  Melanie   Cavill        Sales   35000  7366579  temporary
144    David    Lange  Engineering   45000  7366441  permanent
222    Lewis   Bellow        Sales   30500  7366440  permanent

In [65]:
# employees with a salary higher than 30000 and less than 50000 euros
df_employees[df_employees['salary'].between(30000, 50000, inclusive=False)]

        name lastname          div  salary     tele   contract
457  Melanie   Cavill        Sales   35000  7366579  temporary
144    David    Lange  Engineering   45000  7366441  permanent
222    Lewis   Bellow        Sales   30500  7366440  permanent

It is same as:

In [66]:
# employees with a salary higher than or equal to 30000 and less than or equal to 50000 euros
df_employees[(df_employees['salary']>=30000) & (df_employees['salary']<=50000)]

          name  lastname          div  salary     tele   contract
128    Patrick    Miller        Sales   30000  7366578  permanent
478     Amanda    Torres           IT   54000  7366444  temporary
257  Antonella     Brown           IT   80000  7366120  temporary
299     Eduard  Iglesias        Sales   79000  7366574  permanent
099     Layton     Platt  Engineering   30000  7366777  permanent
457    Melanie    Cavill        Sales   35000  7366579  temporary
144      David     Lange  Engineering   45000  7366441  permanent
222      Lewis    Bellow        Sales   30500  7366440  permanent

#### String methods: Series.str.contains

pandas.Series.str.contains method checks for the presence of a substring in all the elements of a column a

In [70]:
df_employees[df_employees['tele'].str.contains('57')]

        name  lastname    div  salary     tele   contract
128  Patrick    Miller  Sales   30000  7366578  permanent
299   Eduard  Iglesias  Sales   79000  7366574  permanent
457  Melanie    Cavill  Sales   35000  7366579  temporary

In [71]:
df_employees[df_employees['name'].str.contains('r')]

          name  lastname          div  salary     tele    contract
128    Patrick    Miller        Sales   30000  7366578   permanent
299     Eduard  Iglesias        Sales   79000  7366574   permanent
328  Alejandra    Campos  Engineering   18000  7366117  internship

In [72]:
df_employees[df_employees['name'].str.startswith('A')]

          name lastname          div  salary     tele    contract
478     Amanda   Torres           IT   54000  7366444   temporary
257  Antonella    Brown           IT   80000  7366120   temporary
328  Alejandra   Campos  Engineering   18000  7366117  internship

In [75]:
df_employees[df_employees['name'].str.endswith('a')]

          name lastname          div  salary     tele    contract
478     Amanda   Torres           IT   54000  7366444   temporary
257  Antonella    Brown           IT   80000  7366120   temporary
328  Alejandra   Campos  Engineering   18000  7366117  internship